---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnyPatternIdParam
source: html/86b071b1-799e-053c-53c1-a591ea90c8fe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnyPatternIdParam Property

"Fill Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId AnyPatternIdParam { get; }
```